adamkondraciuk/nrfx/mdk/arm_startup_nrf7140_secure.s
; Reset Handler


Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main


                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP

; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler               [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemoryManagement_Handler\
                PROC
                EXPORT  MemoryManagement_Handler  [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler          [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler        [WEAK]
                B       .
                ENDP
SecureFault_Handler\
                PROC
                EXPORT  SecureFault_Handler       [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler               [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler          [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler            [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler           [WEAK]
                B       .
                ENDP

Default_Handler PROC

                EXPORT   SPU000_IRQHandler [WEAK]
                EXPORT   MPC000_IRQHandler [WEAK]
                EXPORT   MVDMA_IRQHandler [WEAK]
                EXPORT   CRACEN_IRQHandler [WEAK]
                EXPORT   SPU010_IRQHandler [WEAK]
                EXPORT   WDT010_IRQHandler [WEAK]
                EXPORT   WDT011_IRQHandler [WEAK]
                EXPORT   TAMPC_IRQHandler [WEAK]
                EXPORT   IPCT_0_IRQHandler [WEAK]
                EXPORT   IPCT_1_IRQHandler [WEAK]
                EXPORT   BELLBOARD_0_IRQHandler [WEAK]
                EXPORT   BELLBOARD_1_IRQHandler [WEAK]
                EXPORT   BELLBOARD_2_IRQHandler [WEAK]
                EXPORT   BELLBOARD_3_IRQHandler [WEAK]
                EXPORT   GPIOTE130_0_IRQHandler [WEAK]
                EXPORT   GPIOTE130_1_IRQHandler [WEAK]
                EXPORT   GRTC_0_IRQHandler [WEAK]
                EXPORT   GRTC_1_IRQHandler [WEAK]
                EXPORT   GRTC_2_IRQHandler [WEAK]
                EXPORT   MPC200_IRQHandler [WEAK]
                EXPORT   SPU200_SPU210_IRQHandler [WEAK]
                EXPORT   CTRLAP_IRQHandler [WEAK]
                EXPORT   TBM_IRQHandler [WEAK]
                EXPORT   SPU110_IRQHandler [WEAK]
                EXPORT   MPC110_IRQHandler [WEAK]
                EXPORT   USBHS_IRQHandler [WEAK]
                EXPORT   SPU111_IRQHandler [WEAK]
                EXPORT   MPC111_IRQHandler [WEAK]
                EXPORT   MRAMC110_IRQHandler [WEAK]
                EXPORT   MRAMC111_IRQHandler [WEAK]
                EXPORT   EXMIF_IRQHandler [WEAK]
                EXPORT   SPU112_IRQHandler [WEAK]
                EXPORT   QSPI110_IRQHandler [WEAK]
                EXPORT   QSPI111_IRQHandler [WEAK]
                EXPORT   SPU120_IRQHandler [WEAK]
                EXPORT   MPC120_IRQHandler [WEAK]
                EXPORT   OTPC_IRQHandler [WEAK]
                EXPORT   VPR120_IRQHandler [WEAK]
                EXPORT   SPU121_IRQHandler [WEAK]
                EXPORT   IPCT120_0_IRQHandler [WEAK]
                EXPORT   I3C120_IRQHandler [WEAK]
                EXPORT   VPR121_IRQHandler [WEAK]
                EXPORT   CAN120_IRQHandler [WEAK]
                EXPORT   MVDMA120_IRQHandler [WEAK]
                EXPORT   CAN121_IRQHandler [WEAK]
                EXPORT   I3C121_IRQHandler [WEAK]
                EXPORT   SPU122_IRQHandler [WEAK]
                EXPORT   TIMER120_IRQHandler [WEAK]
                EXPORT   TIMER121_IRQHandler [WEAK]
                EXPORT   PWM120_IRQHandler [WEAK]
                EXPORT   SPIS120_IRQHandler [WEAK]
                EXPORT   SPIM120_UARTE120_IRQHandler [WEAK]
                EXPORT   SPIM121_IRQHandler [WEAK]
                EXPORT   SPIM122_IRQHandler [WEAK]
                EXPORT   SPIM123_IRQHandler [WEAK]
                EXPORT   SPU130_IRQHandler [WEAK]
                EXPORT   MPC130_IRQHandler [WEAK]
                EXPORT   VPR130_IRQHandler [WEAK]
                EXPORT   SPU131_IRQHandler [WEAK]
                EXPORT   IPCT130_0_IRQHandler [WEAK]
                EXPORT   RTC130_IRQHandler [WEAK]
                EXPORT   RTC131_IRQHandler [WEAK]
                EXPORT   WDT131_IRQHandler [WEAK]
                EXPORT   WDT132_IRQHandler [WEAK]
                EXPORT   EGU130_IRQHandler [WEAK]
                EXPORT   RESETHUB_IRQHandler [WEAK]
                EXPORT   SPU132_IRQHandler [WEAK]
                EXPORT   SAADC_IRQHandler [WEAK]
                EXPORT   COMP_LPCOMP_IRQHandler [WEAK]
                EXPORT   TEMP_IRQHandler [WEAK]
                EXPORT   NFCT_IRQHandler [WEAK]
                EXPORT   SPU133_IRQHandler [WEAK]
                EXPORT   I2S130_IRQHandler [WEAK]
                EXPORT   QDEC130_IRQHandler [WEAK]
                EXPORT   QDEC131_IRQHandler [WEAK]
                EXPORT   SIMIF130_IRQHandler [WEAK]
                EXPORT   I2S131_IRQHandler [WEAK]
                EXPORT   TDM_IRQHandler [WEAK]
                EXPORT   SPU134_IRQHandler [WEAK]
                EXPORT   TIMER130_IRQHandler [WEAK]
                EXPORT   TIMER131_IRQHandler [WEAK]
                EXPORT   PWM130_IRQHandler [WEAK]
                EXPORT   SERIAL0_IRQHandler [WEAK]
                EXPORT   SERIAL1_IRQHandler [WEAK]
                EXPORT   PDM130_IRQHandler [WEAK]
                EXPORT   SPU135_IRQHandler [WEAK]
                EXPORT   TIMER132_IRQHandler [WEAK]
                EXPORT   TIMER133_IRQHandler [WEAK]
                EXPORT   PWM131_IRQHandler [WEAK]
                EXPORT   SERIAL2_IRQHandler [WEAK]
                EXPORT   SERIAL3_IRQHandler [WEAK]
                EXPORT   PDM131_IRQHandler [WEAK]
                EXPORT   SPU136_IRQHandler [WEAK]
                EXPORT   TIMER134_IRQHandler [WEAK]
                EXPORT   TIMER135_IRQHandler [WEAK]
                EXPORT   PWM132_IRQHandler [WEAK]
                EXPORT   SERIAL4_IRQHandler [WEAK]
                EXPORT   SERIAL5_IRQHandler [WEAK]
                EXPORT   PDM132_IRQHandler [WEAK]
                EXPORT   SPU137_IRQHandler [WEAK]
                EXPORT   TIMER136_IRQHandler [WEAK]
                EXPORT   TIMER137_IRQHandler [WEAK]
                EXPORT   PWM133_IRQHandler [WEAK]
                EXPORT   SERIAL6_IRQHandler [WEAK]
                EXPORT   SERIAL7_IRQHandler [WEAK]
                EXPORT   PDM133_IRQHandler [WEAK]
SPU000_IRQHandler
MPC000_IRQHandler
MVDMA_IRQHandler
CRACEN_IRQHandler
SPU010_IRQHandler
WDT010_IRQHandler
WDT011_IRQHandler
TAMPC_IRQHandler
IPCT_0_IRQHandler
IPCT_1_IRQHandler
BELLBOARD_0_IRQHandler
BELLBOARD_1_IRQHandler
BELLBOARD_2_IRQHandler
BELLBOARD_3_IRQHandler
GPIOTE130_0_IRQHandler
GPIOTE130_1_IRQHandler
GRTC_0_IRQHandler
GRTC_1_IRQHandler
GRTC_2_IRQHandler
MPC200_IRQHandler
SPU200_SPU210_IRQHandler
CTRLAP_IRQHandler
TBM_IRQHandler
SPU110_IRQHandler
MPC110_IRQHandler
USBHS_IRQHandler
SPU111_IRQHandler
MPC111_IRQHandler
MRAMC110_IRQHandler
MRAMC111_IRQHandler
EXMIF_IRQHandler
SPU112_IRQHandler
QSPI110_IRQHandler
QSPI111_IRQHandler
SPU120_IRQHandler
MPC120_IRQHandler
OTPC_IRQHandler
VPR120_IRQHandler
SPU121_IRQHandler
IPCT120_0_IRQHandler
I3C120_IRQHandler
VPR121_IRQHandler
CAN120_IRQHandler
MVDMA120_IRQHandler
CAN121_IRQHandler
I3C121_IRQHandler
SPU122_IRQHandler
TIMER120_IRQHandler
TIMER121_IRQHandler
PWM120_IRQHandler
SPIS120_IRQHandler
SPIM120_UARTE120_IRQHandler
SPIM121_IRQHandler
SPIM122_IRQHandler
SPIM123_IRQHandler
SPU130_IRQHandler
MPC130_IRQHandler
VPR130_IRQHandler
SPU131_IRQHandler
IPCT130_0_IRQHandler
RTC130_IRQHandler
RTC131_IRQHandler
WDT131_IRQHandler
WDT132_IRQHandler
EGU130_IRQHandler
RESETHUB_IRQHandler
SPU132_IRQHandler
SAADC_IRQHandler
COMP_LPCOMP_IRQHandler
TEMP_IRQHandler
NFCT_IRQHandler
SPU133_IRQHandler
I2S130_IRQHandler
QDEC130_IRQHandler
QDEC131_IRQHandler
SIMIF130_IRQHandler
I2S131_IRQHandler
TDM_IRQHandler
SPU134_IRQHandler
TIMER130_IRQHandler
TIMER131_IRQHandler
PWM130_IRQHandler
SERIAL0_IRQHandler
SERIAL1_IRQHandler
PDM130_IRQHandler
SPU135_IRQHandler
TIMER132_IRQHandler
TIMER133_IRQHandler
PWM131_IRQHandler
SERIAL2_IRQHandler
SERIAL3_IRQHandler
PDM131_IRQHandler
SPU136_IRQHandler
TIMER134_IRQHandler
TIMER135_IRQHandler
PWM132_IRQHandler
SERIAL4_IRQHandler
SERIAL5_IRQHandler
PDM132_IRQHandler
SPU137_IRQHandler
TIMER136_IRQHandler
TIMER137_IRQHandler
PWM133_IRQHandler
SERIAL6_IRQHandler
SERIAL7_IRQHandler
PDM133_IRQHandler
                B .
                ENDP
                ALIGN

; User Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap

__user_initial_stackheap PROC

                LDR     R0, = Heap_Mem
                LDR     R1, = (Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem + Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR
                ENDP

                ALIGN

                ENDIF

                END
